{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Graph Analytics - Basic Node"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "In this notebook, we're going to get more familiar with our dataset and do some analytics."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "from py2neo import Graph\n",
    "\n",
    "#################################################\n",
    "# Update UPDATE-ME in the connection code with \n",
    "# The server you were assigned (see the schedule \n",
    "# notebook) to connect to using the \n",
    "# Links below.\n",
    "#################################################\n",
    "# Server 0 - neo4j.dsa.missouri.edu\n",
    "# Server 1 - neo4j-1.dsa.missouri.edu\n",
    "# Server 2 - neo4j-2.dsa.missouri.edu\n",
    "# Server 3 - neo4j-3.dsa.missouri.edu\n",
    "#################################################\n",
    "\n",
    "graph = Graph(\"bolt://wikiread:wikireader@neo4j-1.dsa.missouri.edu:9000\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Wikipedia Statistics\n",
    "Our Wikipedia database, all 6.1GB of it, is the total of articles and their links as of 6/1/18.\n",
    "\n",
    "It's always good to know how much data we're working with.\n",
    "Let's see how many articles and links we have.\n",
    "The [cypher reference card](https://neo4j.com/docs/cypher-refcard/3.3/) is a useful resource if you need a quick language guide.\n",
    "\n",
    "Let's first get an idea of the number of pages and links we have.\n",
    "\n",
    "But before that, let's drill into the data types of the objects we are chaining together."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<class 'py2neo.database.Cursor'>\n"
     ]
    }
   ],
   "source": [
    "# What does a graph.run() return?\n",
    "page_total = graph.run(\"MATCH (a) RETURN COUNT(a) as pages\")\n",
    "print(type(page_total))\n",
    "# a Cursor object, which is a structure with a set of results"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "You may have encountered cursors in your prior database studies, or you may have overlooked them.\n",
    "\n",
    "Take a moment to review the concept: https://en.wikipedia.org/wiki/Cursor_%28databases%29\n",
    " * Just review Usage and Scrollable cursors for now\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<class 'py2neo.data.Table'>\n"
     ]
    }
   ],
   "source": [
    "# We can convert that into a table\n",
    "page_total = graph.run(\"MATCH (a) RETURN COUNT(a) as pages\").to_table()\n",
    "print(type(page_total))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<table><tr><th>pages</th></tr><tr><td style=\"text-align:right\">13835767</td></tr></table>"
      ],
      "text/plain": [
       "    pages \r\n",
       "----------\r\n",
       " 13835767 \r\n"
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Note that letting jupyter print the table gives different formatting.\n",
    "page_total = graph.run(\"MATCH (a) RETURN COUNT(a) as pages\").to_table()\n",
    "page_total"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[{'pages': 13835767}]\n"
     ]
    }
   ],
   "source": [
    "# We can also convert it to list of dictionaries, one per row returned\n",
    "page_total = graph.run(\"MATCH (a) RETURN COUNT(a) as pages\").data()\n",
    "print(page_total)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "##### Be careful with conversions of cursors to tables.  \n",
    "If the result set is large, the Python environment can drastically slow down as memory usage increases."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "13835767 pages with 146045322 page links.\n"
     ]
    }
   ],
   "source": [
    "# How many nodes are in our graph?\n",
    "#  This line pulls the first row and column from the graph, the page count\n",
    "page_total = graph.run(\"MATCH (a) RETURN COUNT(a) as pages\").to_table()[0][0]\n",
    "\n",
    "# How many edges?\n",
    "outgoing_links = graph.run(\"MATCH (a)-[r]->(b) RETURN COUNT(r) as links\").to_table()[0][0]\n",
    "\n",
    "print(page_total, \"pages with\", outgoing_links, \"page links.\")\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Looks like we have around 13M articles and 146M page links.\n",
    "\n",
    "It's important to keep in mind how you phrase (draw) your edge directions. \n",
    "Your first thought may be to query edges of any direction, \n",
    "but an outgoing edge is just another node's incoming edge, \n",
    "so we'd expect this count to be twice as large."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "292090610 total links\n"
     ]
    }
   ],
   "source": [
    "total_links = graph.run(\"MATCH (a)-[r]-(b) RETURN COUNT(r) as links\").to_table()[0][0]\n",
    "\n",
    "print(total_links, \"total links\")\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "But that number isn't quite right, is it? \n",
    "We'd expect 292,090,**644** links since we're counting each edge twice, not 292,090,**610**. \n",
    "We're missing 34 or maybe 17 edges, since we'd expect each end of the link to be counted.\n",
    "\n",
    "Ideally, our database can do basic math, and there's not much to the query. \n",
    "Perhaps we have broken links? \n",
    "Our incoming and outgoing totals may not be the same."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "146045322 incoming page links, 146045322 outgoing page links, 292090610 in total\n"
     ]
    }
   ],
   "source": [
    "incoming_links = graph.run(\"MATCH (a)<-[r]-(b) RETURN COUNT(r) as links\").to_table()[0][0]\n",
    "\n",
    "print(incoming_links, \"incoming page links,\", outgoing_links, \"outgoing page links,\", total_links, \"in total\")\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "But they seem to be the same number. The numbers don't lie, or at least shouldn't. \n",
    "If these really are the totals, there must be something wrong with our assumptions. \n",
    "We have the same number of outgoing edges and incoming edges, \n",
    "but our total is slightly less than the sum of the two. \n",
    "Do we have duplicates? \n",
    "Is there another edge type we're not counting somehow?\n",
    "\n",
    "We've counted `a-->b`, `b-->a`, and `a<-->b`, but what about `a-->a`? \n",
    "We assumed there would be two distinct ends to our edges, and that's what we've been counting. \n",
    "We counted `a-->b` and `b<--a`, and we expected that to be the same as `a<-->b`, but when `b` is `a`, we end up with `a-->a` and `a<--a`.\n",
    "\n",
    "`a-->a` and `a<--a` are considered the same when we ask for `a<-->b`, \n",
    "so it's only counted once. \n",
    "This really could be argued either way, \n",
    "but there's not much to gain from arguing with database software. \n",
    "Let's see who these troublesome articles are.\n",
    "\n",
    "\n",
    "Identify the pages that link to themselves."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      " a.title                                       \r\n",
      "-----------------------------------------------\r\n",
      " Etawah                                        \r\n",
      " Greater Chennai Corporation                   \r\n",
      " Empty calorie                                 \r\n",
      " Sunnybank Rugby                               \r\n",
      " Souths Rugby                                  \r\n",
      " Botswana Telecommunications Corporation       \r\n",
      " Pococí (canton)                               \r\n",
      " London Buses route 98                         \r\n",
      " Star Maa                                      \r\n",
      " King Edward VII School                        \r\n",
      " Melrose–Rugby, Roanoke, Virginia              \r\n",
      " Jalalpur Pirwala                              \r\n",
      " Cobhams Asuquo                                \r\n",
      " Gayaza                                        \r\n",
      " Clapham Town (ward)                           \r\n",
      " Stockwell (ward)                              \r\n",
      " Knight's Hill (ward)                          \r\n",
      " Phillip Ingram                                \r\n",
      " Teru                                          \r\n",
      " Saboba                                        \r\n",
      " Kendriya Vidyalaya Muzaffarpur                \r\n",
      " George Dudley Seymour State Park              \r\n",
      " Arjunna Harjaie                               \r\n",
      " Rajesh Anandan                                \r\n",
      " 1891 in Sweden                                \r\n",
      " 1892 in Sweden                                \r\n",
      " Temple of Isis and Serapis                    \r\n",
      " Morang XI                                     \r\n",
      " Psyllopsis                                    \r\n",
      " Top Dutch Joint Solar Array                   \r\n",
      " Chhatisgarh Pradesh Mahila Congress Committee \r\n",
      " Schizopilia                                   \r\n",
      " Leveson Venables-Vernon-Harcourt              \r\n",
      " John Lambe (priest)                           \r\n",
      "\n"
     ]
    }
   ],
   "source": [
    "# Notice the where clause\n",
    "data = graph.run(\"MATCH (a)-->(b) WHERE a = b RETURN a.title\").to_table()\n",
    "print(data)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Inter-page links are formatted differently than intra-page links in Wikipedia. \n",
    "These 34 pages are most likely _style guide violations_ that had not been corrected at the time of download.\n",
    "\n",
    "With our edge mysteries accounted for, let's look at our nodes."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "----------\n",
    "### <span style=\"background:yellow\">Your Turn</span>\n",
    "\n",
    "In theory, we can have four types of nodes.\n",
    "One with no links, one with only incoming links, \n",
    "one with only outgoing links, and one with both. \n",
    "Let's verify this and see if the sum of all four cases matches our node total.\n",
    "\n",
    "**As a starter hint: Which set of those will this match?**\n",
    "```\n",
    "MATCH (n) WHERE NOT (n)--() RETURN COUNT(n)\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "500848 with no links (3.62%)\n",
      "301756 with only incoming links (2.18%)\n",
      "5205846 with only outgoing links (37.63%)\n",
      "7827317 with both (56.57%)\n",
      "13835767 total, 13835767 expected\n",
      "\n"
     ]
    }
   ],
   "source": [
    "# M4:P1:Q1\n",
    "nodes_none,nodes_in,nodes_out,nodes_in_out = (0,0,0,0)\n",
    "\n",
    "# Construct where clauses to count these four\n",
    "#  types of nodes and verify our hypothesis.\n",
    "# HINT: node and edge connections can be \n",
    "#       used in where clauses\n",
    "# ----------------------------\n",
    "\n",
    "nodes_none = graph.run(\"\"\"\n",
    "MATCH (n) WHERE NOT (n)--() RETURN COUNT(n)\n",
    "\"\"\").to_table()[0][0]\n",
    "\n",
    "\n",
    "nodes_in = graph.run(\"\"\"\n",
    "MATCH (n) WHERE (n)<--() and NOT (n)-->()  RETURN COUNT(n)\n",
    "\"\"\").to_table()[0][0]\n",
    "\n",
    "\n",
    "nodes_out = graph.run(\"\"\"\n",
    "MATCH (n) WHERE (n)-->() and NOT (n)<--() RETURN COUNT(n)\n",
    "\"\"\").to_table()[0][0]\n",
    "\n",
    "\n",
    "nodes_in_out = graph.run(\"\"\"\n",
    "MATCH (n) WHERE (n)-->() and (n)<--() RETURN COUNT(n)\n",
    "\"\"\").to_table()[0][0]\n",
    "\n",
    "\n",
    "query_total = nodes_none + nodes_in + nodes_out + nodes_in_out\n",
    "\n",
    "print(\n",
    "    (\n",
    "     \"{} with no links ({:.2f}%)\\n\"\n",
    "     \"{} with only incoming links ({:.2f}%)\\n\"\n",
    "     \"{} with only outgoing links ({:.2f}%)\\n\"\n",
    "     \"{} with both ({:.2f}%)\\n{} total, {} expected\\n\"   \n",
    "    ).format(\n",
    "        nodes_none, \n",
    "        nodes_none/query_total*100, \n",
    "        nodes_in, \n",
    "        nodes_in/query_total*100, \n",
    "        nodes_out, \n",
    "        nodes_out/query_total*100, \n",
    "        nodes_in_out, \n",
    "        nodes_in_out/query_total*100, \n",
    "        query_total, \n",
    "        page_total)\n",
    ")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "---\n",
    "As you can see, this is just the tip of the iceberg when it comes to analytics using graph databases.\n",
    "The lessons continue by diving deeper into link analysis."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Save your Notebook, then `File > Close and Halt`"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "---"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.4.9"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
